// Decompiled by Jad v1.5.8g. Copyright 2001 Pavel Kouznetsov.
// Jad home page: http://www.kpdus.com/jad.html
// Decompiler options: packimports(3) fieldsfirst ansi

package gnnt.mebsv.hqservice.tools;

public class HZPY {

	private static final int ABC_NUM = 26;
	private static final int HZ_ASCII = 161;
	private static final int HZ_QU_LO = 176;
	private static final int HZ_WEI_LO = 161;
	private static final int HZ_QU_HI = 247;
	private static final int HZ_WEI_HI = 254;
	private static final int _HZ_PY_Tab_GBK[] = { 45253, 45761, 46318, 46826, 47010, 47297, 47614, 48120, 48120, 49062, 49324, 49896, 50371, 50614,
			50622, 50906, 51387, 51446, 52218, 52698, 52698, 52698, 52980, 53689, 54481, 55456 };
	private static final String HZ_Ext_Tab = "呵吖锕腌嗄呆捱锿霭嗳瑷砹暧嗌嫒厂广桉鹌庵谙埯揞铵黯犴嚣聱獒螯鳌遨嗷廒鏖拗媪鏊骜坳岙岜粑茇菝魃钯鲅灞伯掰捭呗癍瘢坂钣舨阪浜蒡炮曝刨瀑龅煲孢葆鸨褓趵宀勹臂埤萆鹎陂鞴蓓孛碚邶悖褙鐾呗夯贲锛畚坌蚌嘣甏拂秘泌荸吡秕俾舭匕妣贲埤芘荜萆薜哔畀跸髀铋筚箅篦狴庳愎滗濞裨璧襞嬖弼婢砭蝙笾鳊飚煸碥匾窆褊苄忭汴弁缏勺髟杓飙镖镳飑瘭骠裱婊鳔蹩玢槟豳镔傧缤鬓殡髌膑屏槟邴禀摒疒般剥薄柏百魄卜趵饽孛鹁礴踣钹亳跛掰簸檗擘啵堡埔逋晡钸醭卟钚瓿拆嚓礤掺骖黪璨粲孱伧嘈螬艚漕艹恻刂曾噌差兹伺呲茈糍鹚祠璁苁枞骢琮淙楱辏腠卒殂徂蔟酢蹙蹴猝攒撺镩汆爨衰榱隹璀萃啐毳悴蹲皴忖蹉鹾嵯矬痤瘥脞厝锉刹喳杈嚓锸馇楂槎檫猹镲衩汊姹差钗侪虿瘥单觇躔蟾镡廛澶潺禅孱婵蒇冁谄骣忏羼裳倘菖伥鲳阊娼苌徜嫦氅惝昶鬯怅绰剿怊焯晁耖尺砗坼橙沈秤称琛抻嗔宸谌碜榇龀谶伧盛柽瞠蛏噌铛埕枨酲铖塍裎丞眵哧螭嗤笞魑鸱蚩媸坻墀茌踟篪豉褫敕叱傺彳饬瘛啻重涌种舂茺艟忡憧铳瘳帱俦雠惆畜蹰蜍刍樗楮杵褚亍黜憷怵绌屮搋踹嘬啜膪氚巛遄舡舛钏怆椎棰槌陲蝽莼鹑踔辍龊啜塔耷嗒哒褡鞑靼笪怛沓妲疸大呔玳甙埭黛岱骀迨绐石聃眈箪儋瘅赕疸萏啖澹卩殚亻铛裆谠菪砀宕凼叨氘忉焘纛帱地底锝澄噔簦戥磴嶝镫提的嘀镝氐羝荻觌籴坻柢砥骶邸诋棣碲睇谛娣绨巅癫踮丶玷坫钿簟癜阽鸟貂鲷铞铫踮堞垤耋揲喋蹀牒佚瓞鲽玎耵酊町仃疔碇啶铤腚铥鸫咚岽氡硐垌峒胨胴夂都读蔸篼蚪窦顿嘟椟黩髑牍渎笃芏蠹椴簖煅敦碓镦憝怼礅镦趸盹砘炖沌度驮咄裰踱铎哚缍柁沲阿哦屙婀莪锇苊萼垩噩轭呃颚鹗锷腭鳄愕阏谔蒽摁鸸鲕珥铒迩佴垡砝蕃幡蘩蹯燔梵畈犭攵枋钫邡鲂彷舫霏蜚鲱扉妃绯腓淝榧斐翡篚悱芾镄狒痱玢棼鼢偾鲼瀵葑砜酆沣唪俸缶麸呋趺跗稃芙芾茯苻莩菔桴砩黻蚨蝠蜉罘幞孚郛匐凫怫祓艴绂绋拊黼滏蝮赙馥鳆鲋驸佛咯合屹盖圪仡袼纥塥鬲嗝骼镉搿颌膈舸哿硌虼哏艮茛亘颈赓哽鲠绠夹咖胳轧伽旮尜钆尕尬芥垓赅陔丐戤乾坩苷酐矸尴疳泔橄擀澉旰淦绀扛罡筻戆槔睾藁槁杲缟锆郜诰红蚣肱觥珙句鞲枸篝佝缑岣笱觏遘彀诟媾贾毂鸪菰酤轱蛄呱觚瞽嘏罟鹘钴牯鹄臌汩诂梏崮锢牿鲴痼括栝呱鸹胍卦诖掴纶莞倌鳏矜鹳掼盥涫桄咣胱犷傀炔皈鲑妫匦晷簋庋宄桧炅刿鳜磙鲧衮绲涡埚聒蝈呙崞掴帼虢馘椁蜾猓吓嗬诃盍翮曷蚵颌劾阖纥壑嗨行珩蘅桁虾蛤铪还嘿咳嗨醢胲顸蚶鼾邗晗焓阚菡撖颔瀚行吭巷珩颃绗沆镐貉蒿薅嚆蚝嗥濠昊颢皓灏薨訇蕻荭闳黉泓讧骺篌瘊糇堠逅後鲎核和戏轷唿惚烀滹觳鹕槲醐囫鹘鹄猢斛煳琥浒瓠岵笏鹱怙冱扈戽祜虍豁砉铧骅桦踝划獾鬟萑圜锾郇洹寰缳擐鲩奂漶浣逭肓璜蟥篁遑徨鳇癀潢湟隍堕徊溃珲虺咴晖麾诙隳茴洄彗恚蕙荟桧蟪哕喙浍缋阍珲馄溷诨和耠劐攉锪夥钬藿嚯蠖镬唧其期奇藉革给系齐玑芨赍墼丌矶剞咭跻叽羁犄嵇笄齑屐畿蕺蒺楫殛戢岌嵴笈佶诘亟戟掎虮麂髻芰荠霁跽哜觊稷偈鲚鲫洎暨骥乩瘠茄挟珈葭跏镓笳伽痂浃袈迦恝戛郏蛱铗袷嘏岬胛瘕浅戋鞯蒹菅搛犍鲣鹣湔缣戬枧睑趼囝锏笕翦蹇謇裥谫楗踺毽僭牮腱谏廴强虹茳豇礓缰耩糨洚犟绛校觉艽跤蛟僬鹪鲛姣峤挢佼皎敫徼湫醮噍纟茭楷价家喈嗟疖颉碣拮偈鲒桀羯讦诘孑婕蚧骱衿矜瑾堇槿馑廑卺觐荩噤赆妗缙钅劲菁腈旌泾儆肼憬阱刭靓胫獍弪迳婧扃炅迥鬏赳啾鸠柩桕僦阄鹫车且桔柜琚趄鞫苴椐掬俊圈镌蠲涓锩鄄隽狷桊嚼脚角噘嗟珏蕨橛桷厥劂矍蹶噱崛镢獗觖爝谲孓龟筠麇皲捃呵珂轲瞌嗑蝌髁钶稞疴颏窠岢蚵锞氪恪溘骒缂龈裉铿咔佧胩锎垲蒈剀锴铠恺忾槛嵌戡龛莰侃阚瞰闶钪伉尻栲铐犒崆箜倥芤眍蔻叩筘堀刳骷喾绔侉会蒯哙郐脍狯浍傀哐诓诳夼圹贶邝纩悝逵揆睽喹暌蝰馗夔隗跬聩蒉匮喟篑愦琨髡琨髡醌锟鲲悃阃适栝蛞落蓝邋砬旯剌瘌崃铼徕涞赉睐籁癞濑岚镧斓褴榄罱漤啷螂锒稂阆蒗莨潦落络醪唠崂铹痨栳铑耢肋了叻仂鳓泐勒檑羸嫘缧耒诔酹嘞塄愣嫠藜蓠鹂喱蜊罹黧鲡骊蠡缡醴逦锂俚鳢悝澧娌坜苈莅枥栎鬲郦砺雳轹呖跞蛎唳詈篥笠俪猁疠疬粝溧戾奁蠊臁鲢濂裢琏蔹裣楝殓潋墚莨椋踉俩魉靓冫鹩嘹獠寮缭蓼钌尥咧鬣趔埒捩躐辚瞵啉嶙麟粼遴檩廪懔蔺躏膦冽洌棱聆苓柃棂酃蛉囹瓴翎鲮泠绫呤镏碌陆熘镝遛桎旒浏鎏骝锍绺鹨弄珑茏栊砻胧癃泷垅耧蒌蝼喽髅偻嵝露镂瘘撸噜垆栌轳鸬舻胪鲈泸橹镥璐蓼辂辘鹭簏六漉渌逯绿氇律率虑氯旅滤铝履吕屡缕驴侣偻稆榈闾捋膂褛栾脔銮鸾娈锊囵咯烙捋椤镙脶猡倮瘰蠃珞荦硌摞雒漯泺偻稆偻稆榈闾捋膂褛抹摩么嬷蟆犸杩唛霾荬劢颟鞔埋鳗螨墁幔镘熳缦硭邙蟒漭髦茆牦旄蟊昴峁泖瑁耄懋袤瞀麽莓楣嵋镅猸糜湄鹛浼魅袂谜扪钔焖懑甍瞢礞虻艨朦氓蠓蜢艋懵勐咪蘼猕縻麋祢芈脒敉弭嘧汨宓谧糸眄黾腼沔湎渑喵鹋杪眇邈淼缈缪咩乜蠛篾玟珉苠岷缗黾鳘闵泯愍盟茗瞑暝溟冥酩缪万冒嘿貉脉馍无麽谟嫫耱茉蓦殁镆秣貘貊瘼没哞眸蛑侔蝥鍪缪姥模毪坶苜钼仫沐牟南镎捺呢肭衲哪艿萘柰佴囝囡楠喃赧蝻腩囔馕攮曩孬硇蛲呶铙猱努瑙垴哪呐讷那恁坭呢铌鲵猊怩旎祢慝睨昵伲尿黏鲇鲶粘辇埝廿酿茑嬲袅脲溺颞蘖嗫蹑臬陧乜恁聍苎咛甯佞妞狃忸拗哝侬廾孥驽胬弩女钕恧衄娜傩搦喏锘钕恧衄噢喔区瓯讴耦怄扒耙葩派杷钯筢怄迫俳蒎哌扳番般蹒蟠胖爿拚泮襻袢膀磅滂螃彷逄脬匏狍庖疱醅锫霈帔旆辔湓嘭怦堋蟛坏辟否丕邳噼铍纰鼙埤芘枇蚍蜱罴郫铍貔裨陴陂圮撸圮擗吡仳庀癖疋睥僻淠甓媲扁便犏翩蹁胼缏骈谝爿剽螵缥朴嫖莩殍瞟嘌骠氕苤丿拚姘苹颦嫔榀牝冯俜娉枰鲆冖泊繁朴攴钋泺陂皤鄱叵钷笸珀掊裒脯堡暴噗璞镤匍濮埔蹼镨氆溥稽萋槭桤欹嘁蹊缉琪琦亓圻耆綦萁芪荠蕲蜞蛴岐俟颀鳍麒淇祺骐芑杞屺綮绮葺碛憩汔亟卡葜伽袷髂纤芊岍愆佥悭搴褰骞阡鬈荨掮虔钤犍箝肷缱茜芡椠倩慊将跄蜣锖锵镪戗戕樯嫱羟襁炝雀蕉壳硗跷劁缲鞒荞樵峤憔谯愀诮砌伽挈趄锲箧郄妾惬慊衾芩檎覃嗪螓噙锓廑溱矜揿吣圊蜻鲭檠黥謦苘磬罄箐綮亲跫蛩銎邛茕筇穹龟仇楸蚯鳅湫裘逑蝤虬赇俅鼽犰遒巯糗匚麴蕖觑蛐黢岖祛诎璩蘧磲瞿氍蠼衢朐鸲劬癯苣阒戌悛鬈荃辁蜷铨筌诠畎绻阙悫阕逡麇髯蚺苒穰禳荛桡娆若喏荏稔葚轫仞饪衽榕蝾嵘肜狨鞣蹂糅薷颥嚅铷濡襦蓐溽洳缛朊蕤芮枘睿蚋箬偌仨挲卅脎飒思噻彡毵霰馓糁氵磉搡颡瘙臊鳋缲缫埽梢塞啬铯穑食厕厮蛳咝锶澌厶缌鸶耜兕笥俟泗汜祀驷姒灬菘崧嵩忪凇淞竦悚螋嗖锼馊飕溲薮瞍嗾叟缩稣蔌嗉簌觫夙愫涑谡狻尿荽眭睢濉燧邃谇荪狲飧榫隼莎桫睃嗦嗍羧挲娑唢杉厦铩痧挲鲨裟霎嗄唼歃色酾栅掸掺单髟埏芟跚钐舢膻潸姗蟮鳝疝鄯剡禅讪骟嬗凵殇觞熵汤垧绱鞘召蛸筲艄苕杓潲劭折畲猞佘厍歙麝滠参什莘糁诜哂矧渖谂葚椹蜃胂乘笙渑眚晟嵊嘘峙似匙蓍酾鲺埘莳鲥炻豕螫贳轼铈舐筮弑谥殖饣礻熟艏狩绶俞菽摅倏毹殳姝纾疋秫塾丨腧澍沭忄唰率蟀闩涮泷孀说数蒴搠铄槊妁拓遢趿铊溻鳎榻嗒闼漯沓薹跆鲐骀炱邰呔钛肽弹覃昙镡锬郯澹忐钽耥镗铴羰瑭樘醣螳螗饧溏傥帑焘韬饕叨啕鼗洮慝忑忒铽滕荑醍鹈缇绨倜逖悌裼扌佃畋钿阗忝殄掭佻调祧髫苕龆蜩笤鲦窕粜萜餮莛葶霆蜓婷梃町铤侗恫嗵垌茼砼峒佟仝潼恸冂骰钭荼菟酴钍堍抟疃彖忒煺囤褪暾豚饨氽舵魄乇坨柁橐酡砣跎鼍铊佗沱庹柝箨凹娲佤腽崴娩蔓蜿剜芄纨琬莞菀畹脘绾芒尢辋罔魍惘遗葳薇崴逶偎煨隈圩囗帏帷嵬闱涠沩玮隗韪艉鲔猥痿炜洧诿娓軎猬雯璺阌刎汶亠蓊蕹莴喔倭硪龌幄肟渥恶亡圬兀邬於唔蜈鼯浯鹉迕牾仵庑怃忤妩芴杌痦焐鋈寤阢鹜骛婺腊栖熹菥茜皙樨醯曦蹊蜥螅蟋唏僖鼷舾翕歙欷郗兮奚羲粞淅浠穸裼嬉觋隰葸蓰徙玺禧屣舄饩阋禊唬呷瑕柙硖黠狎瘕遐罅铣洗见莶酰暹跹氙籼祆痫鹇娴藓燹跣蚬筅猃冼苋霰岘降葙芗骧缃庠饷鲞飨蟓枵逍哓蛸箫魈枭潇骁绡崤筱血叶契解颉撷偕勰缬薤榭榍躞獬邂亵廨燮渫瀣绁寻馨昕鑫歆镡囟省荥硎饧陉擤荇悻芎臭宿髹咻鸺貅馐庥岫溴吁砉顼圩盱胥栩醑糈浒诩勖煦洫溆蓿券萱揎暄儇煊谖璇痃漩楦碹镟铉炫泫渲削踅噱泶鳕谑荤浚埙薰醺曛獯窨荀峋郇鲟恂洵浔徇巽彐匹轧垭桠琊睚岈伢痖疋砑揠迓氩娅铅鄢菸崦殷腌胭恹阏湮嫣芫檐筵闫阽妍琰郾厣魇罨俨偃鼹兖剡酽餍赝晏焱滟谳讠鞅泱蛘徉烊陶约侥钥疟吆夭幺珧轺铫徭肴爻繇鳐杳崾窈曜鹞邪拽咽哗揶铘邺晔烨谒靥蛇蛾尾艾欹咿噫黟猗漪圯荑眙咦贻嶷迤饴痍怡诒苡酏钇舣旖埸懿薏翳殪挹轶弋呓蜴嗌峄镱镒佚仡佾劓刈瘗癔弈奕翊悒怿熠羿驿缢衤烟堙喑铟氤湮洇圻垠鄞霪龈狺夤蚓吲瘾茚胤窨瑛璎莺撄嘤罂鹦膺茔蓥荥萦楹嬴滢潆瀛郢颍瘿媵育唷墉镛鳙壅饔慵邕喁俑甬呦攸莜莸柚尢蚰蝣蝤繇鱿疣猷莠卣黝铕牖蚴囿侑鼬宥尉蔚谷粥瘀於纡瑜萸雩揄欤禺蝓嵛竽舁臾觎腴狳馀窬谀妤龉圉圄伛俣庾瘐窳菀蓣昱蜮钰毓鹆饫阈煜燠谕聿熨鬻鹬妪肀鸢鸢箢眢鼋塬芫橼螈圜爰沅媛瑗垸掾乐说樾栎钺龠刖瀹均氲芸员昀筠纭殒狁韫愠恽郓熨咋扎咱拶咂甾崽仔簪糌趱拶昝甾崽仔簪糌趱拶昝瓒錾藏臧驵奘缲唣侧赜啧咋帻迮箦笮舴仄昃谮罾缯综锃甑吱髭趑辎龇赀觜訾呲嵫锱鲻孳粢谘缁耔茈梓秭笫姊眦恣枞腙偬粽鄹鲰诹陬驺辶菹镞俎躜缵攥赚堆咀觜蕞樽鳟撙琢凿撮嘬笮酢唑胙怍祚阼阝查蜡楂揸哳吒齄喋砟柞蚱咤痄侧择翟祭砦瘵旃谵搌颤长璋蟑长璋蟑獐鄣嫜仉幛嶂朝着嘲爪啁钊棹笊诏着蜇磔摺辄谪赭褶柘鹧这蓁榛椹桢箴胗溱浈祯轸畛稹缜圳赈朕鸩丁峥钲铮筝徵鲭诤氏识栀卮胝祗埴絷摭跖踯芷枳酯轵黹徵祉咫栉桎贽鸷轾郅踬蛭帙雉豸膣觯痣忮陟骘彘舯锺螽忪踵冢啁碡妯荮酎胄籀繇纣绉术茱槠铢邾侏橥洙潴躅竺舳瘃麈渚褚属翥苎杼箸伫疰炷挝转曳嘬传颛啭馔沌幢奘僮戆丬隹隹骓惴缒屯肫窀缴焯涿著斫擢镯浞濯禚诼倬";
	private static byte _HZ_Ext_Tab[];
	private static short _HZ_Ext_Num[] = { 41, 205, 435, 603, 631, 716, 883, 1056, 1056, 1305, 1413, 1688, 1842, 1940, 1947, 2091, 2283, 2326, 2559,
			2697, 2697, 2697, 2793, 2994, 3303, 3600 };
	private static String HZ_ABC_Tab = "ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ";
	private static byte _HZ_ABC_Tab[];

	public HZPY() {
	}

	public static String[] getPYJM(String s, String s1) throws Exception {
		int ai[] = _HZ_PY_Tab_GBK;
		byte abyte0[] = new byte[0];
		try {
			_HZ_Ext_Tab = "呵吖锕腌嗄呆捱锿霭嗳瑷砹暧嗌嫒厂广桉鹌庵谙埯揞铵黯犴嚣聱獒螯鳌遨嗷廒鏖拗媪鏊骜坳岙岜粑茇菝魃钯鲅灞伯掰捭呗癍瘢坂钣舨阪浜蒡炮曝刨瀑龅煲孢葆鸨褓趵宀勹臂埤萆鹎陂鞴蓓孛碚邶悖褙鐾呗夯贲锛畚坌蚌嘣甏拂秘泌荸吡秕俾舭匕妣贲埤芘荜萆薜哔畀跸髀铋筚箅篦狴庳愎滗濞裨璧襞嬖弼婢砭蝙笾鳊飚煸碥匾窆褊苄忭汴弁缏勺髟杓飙镖镳飑瘭骠裱婊鳔蹩玢槟豳镔傧缤鬓殡髌膑屏槟邴禀摒疒般剥薄柏百魄卜趵饽孛鹁礴踣钹亳跛掰簸檗擘啵堡埔逋晡钸醭卟钚瓿拆嚓礤掺骖黪璨粲孱伧嘈螬艚漕艹恻刂曾噌差兹伺呲茈糍鹚祠璁苁枞骢琮淙楱辏腠卒殂徂蔟酢蹙蹴猝攒撺镩汆爨衰榱隹璀萃啐毳悴蹲皴忖蹉鹾嵯矬痤瘥脞厝锉刹喳杈嚓锸馇楂槎檫猹镲衩汊姹差钗侪虿瘥单觇躔蟾镡廛澶潺禅孱婵蒇冁谄骣忏羼裳倘菖伥鲳阊娼苌徜嫦氅惝昶鬯怅绰剿怊焯晁耖尺砗坼橙沈秤称琛抻嗔宸谌碜榇龀谶伧盛柽瞠蛏噌铛埕枨酲铖塍裎丞眵哧螭嗤笞魑鸱蚩媸坻墀茌踟篪豉褫敕叱傺彳饬瘛啻重涌种舂茺艟忡憧铳瘳帱俦雠惆畜蹰蜍刍樗楮杵褚亍黜憷怵绌屮搋踹嘬啜膪氚巛遄舡舛钏怆椎棰槌陲蝽莼鹑踔辍龊啜塔耷嗒哒褡鞑靼笪怛沓妲疸大呔玳甙埭黛岱骀迨绐石聃眈箪儋瘅赕疸萏啖澹卩殚亻铛裆谠菪砀宕凼叨氘忉焘纛帱地底锝澄噔簦戥磴嶝镫提的嘀镝氐羝荻觌籴坻柢砥骶邸诋棣碲睇谛娣绨巅癫踮丶玷坫钿簟癜阽鸟貂鲷铞铫踮堞垤耋揲喋蹀牒佚瓞鲽玎耵酊町仃疔碇啶铤腚铥鸫咚岽氡硐垌峒胨胴夂都读蔸篼蚪窦顿嘟椟黩髑牍渎笃芏蠹椴簖煅敦碓镦憝怼礅镦趸盹砘炖沌度驮咄裰踱铎哚缍柁沲阿哦屙婀莪锇苊萼垩噩轭呃颚鹗锷腭鳄愕阏谔蒽摁鸸鲕珥铒迩佴垡砝蕃幡蘩蹯燔梵畈犭攵枋钫邡鲂彷舫霏蜚鲱扉妃绯腓淝榧斐翡篚悱芾镄狒痱玢棼鼢偾鲼瀵葑砜酆沣唪俸缶麸呋趺跗稃芙芾茯苻莩菔桴砩黻蚨蝠蜉罘幞孚郛匐凫怫祓艴绂绋拊黼滏蝮赙馥鳆鲋驸佛咯合屹盖圪仡袼纥塥鬲嗝骼镉搿颌膈舸哿硌虼哏艮茛亘颈赓哽鲠绠夹咖胳轧伽旮尜钆尕尬芥垓赅陔丐戤乾坩苷酐矸尴疳泔橄擀澉旰淦绀扛罡筻戆槔睾藁槁杲缟锆郜诰红蚣肱觥珙句鞲枸篝佝缑岣笱觏遘彀诟媾贾毂鸪菰酤轱蛄呱觚瞽嘏罟鹘钴牯鹄臌汩诂梏崮锢牿鲴痼括栝呱鸹胍卦诖掴纶莞倌鳏矜鹳掼盥涫桄咣胱犷傀炔皈鲑妫匦晷簋庋宄桧炅刿鳜磙鲧衮绲涡埚聒蝈呙崞掴帼虢馘椁蜾猓吓嗬诃盍翮曷蚵颌劾阖纥壑嗨行珩蘅桁虾蛤铪还嘿咳嗨醢胲顸蚶鼾邗晗焓阚菡撖颔瀚行吭巷珩颃绗沆镐貉蒿薅嚆蚝嗥濠昊颢皓灏薨訇蕻荭闳黉泓讧骺篌瘊糇堠逅後鲎核和戏轷唿惚烀滹觳鹕槲醐囫鹘鹄猢斛煳琥浒瓠岵笏鹱怙冱扈戽祜虍豁砉铧骅桦踝划獾鬟萑圜锾郇洹寰缳擐鲩奂漶浣逭肓璜蟥篁遑徨鳇癀潢湟隍堕徊溃珲虺咴晖麾诙隳茴洄彗恚蕙荟桧蟪哕喙浍缋阍珲馄溷诨和耠劐攉锪夥钬藿嚯蠖镬唧其期奇藉革给系齐玑芨赍墼丌矶剞咭跻叽羁犄嵇笄齑屐畿蕺蒺楫殛戢岌嵴笈佶诘亟戟掎虮麂髻芰荠霁跽哜觊稷偈鲚鲫洎暨骥乩瘠茄挟珈葭跏镓笳伽痂浃袈迦恝戛郏蛱铗袷嘏岬胛瘕浅戋鞯蒹菅搛犍鲣鹣湔缣戬枧睑趼囝锏笕翦蹇謇裥谫楗踺毽僭牮腱谏廴强虹茳豇礓缰耩糨洚犟绛校觉艽跤蛟僬鹪鲛姣峤挢佼皎敫徼湫醮噍纟茭楷价家喈嗟疖颉碣拮偈鲒桀羯讦诘孑婕蚧骱衿矜瑾堇槿馑廑卺觐荩噤赆妗缙钅劲菁腈旌泾儆肼憬阱刭靓胫獍弪迳婧扃炅迥鬏赳啾鸠柩桕僦阄鹫车且桔柜琚趄鞫苴椐掬俊圈镌蠲涓锩鄄隽狷桊嚼脚角噘嗟珏蕨橛桷厥劂矍蹶噱崛镢獗觖爝谲孓龟筠麇皲捃呵珂轲瞌嗑蝌髁钶稞疴颏窠岢蚵锞氪恪溘骒缂龈裉铿咔佧胩锎垲蒈剀锴铠恺忾槛嵌戡龛莰侃阚瞰闶钪伉尻栲铐犒崆箜倥芤眍蔻叩筘堀刳骷喾绔侉会蒯哙郐脍狯浍傀哐诓诳夼圹贶邝纩悝逵揆睽喹暌蝰馗夔隗跬聩蒉匮喟篑愦琨髡琨髡醌锟鲲悃阃适栝蛞落蓝邋砬旯剌瘌崃铼徕涞赉睐籁癞濑岚镧斓褴榄罱漤啷螂锒稂阆蒗莨潦落络醪唠崂铹痨栳铑耢肋了叻仂鳓泐勒檑羸嫘缧耒诔酹嘞塄愣嫠藜蓠鹂喱蜊罹黧鲡骊蠡缡醴逦锂俚鳢悝澧娌坜苈莅枥栎鬲郦砺雳轹呖跞蛎唳詈篥笠俪猁疠疬粝溧戾奁蠊臁鲢濂裢琏蔹裣楝殓潋墚莨椋踉俩魉靓冫鹩嘹獠寮缭蓼钌尥咧鬣趔埒捩躐辚瞵啉嶙麟粼遴檩廪懔蔺躏膦冽洌棱聆苓柃棂酃蛉囹瓴翎鲮泠绫呤镏碌陆熘镝遛桎旒浏鎏骝锍绺鹨弄珑茏栊砻胧癃泷垅耧蒌蝼喽髅偻嵝露镂瘘撸噜垆栌轳鸬舻胪鲈泸橹镥璐蓼辂辘鹭簏六漉渌逯绿氇律率虑氯旅滤铝履吕屡缕驴侣偻稆榈闾捋膂褛栾脔銮鸾娈锊囵咯烙捋椤镙脶猡倮瘰蠃珞荦硌摞雒漯泺偻稆偻稆榈闾捋膂褛抹摩么嬷蟆犸杩唛霾荬劢颟鞔埋鳗螨墁幔镘熳缦硭邙蟒漭髦茆牦旄蟊昴峁泖瑁耄懋袤瞀麽莓楣嵋镅猸糜湄鹛浼魅袂谜扪钔焖懑甍瞢礞虻艨朦氓蠓蜢艋懵勐咪蘼猕縻麋祢芈脒敉弭嘧汨宓谧糸眄黾腼沔湎渑喵鹋杪眇邈淼缈缪咩乜蠛篾玟珉苠岷缗黾鳘闵泯愍盟茗瞑暝溟冥酩缪万冒嘿貉脉馍无麽谟嫫耱茉蓦殁镆秣貘貊瘼没哞眸蛑侔蝥鍪缪姥模毪坶苜钼仫沐牟南镎捺呢肭衲哪艿萘柰佴囝囡楠喃赧蝻腩囔馕攮曩孬硇蛲呶铙猱努瑙垴哪呐讷那恁坭呢铌鲵猊怩旎祢慝睨昵伲尿黏鲇鲶粘辇埝廿酿茑嬲袅脲溺颞蘖嗫蹑臬陧乜恁聍苎咛甯佞妞狃忸拗哝侬廾孥驽胬弩女钕恧衄娜傩搦喏锘钕恧衄噢喔区瓯讴耦怄扒耙葩派杷钯筢怄迫俳蒎哌扳番般蹒蟠胖爿拚泮襻袢膀磅滂螃彷逄脬匏狍庖疱醅锫霈帔旆辔湓嘭怦堋蟛坏辟否丕邳噼铍纰鼙埤芘枇蚍蜱罴郫铍貔裨陴陂圮撸圮擗吡仳庀癖疋睥僻淠甓媲扁便犏翩蹁胼缏骈谝爿剽螵缥朴嫖莩殍瞟嘌骠氕苤丿拚姘苹颦嫔榀牝冯俜娉枰鲆冖泊繁朴攴钋泺陂皤鄱叵钷笸珀掊裒脯堡暴噗璞镤匍濮埔蹼镨氆溥稽萋槭桤欹嘁蹊缉琪琦亓圻耆綦萁芪荠蕲蜞蛴岐俟颀鳍麒淇祺骐芑杞屺綮绮葺碛憩汔亟卡葜伽袷髂纤芊岍愆佥悭搴褰骞阡鬈荨掮虔钤犍箝肷缱茜芡椠倩慊将跄蜣锖锵镪戗戕樯嫱羟襁炝雀蕉壳硗跷劁缲鞒荞樵峤憔谯愀诮砌伽挈趄锲箧郄妾惬慊衾芩檎覃嗪螓噙锓廑溱矜揿吣圊蜻鲭檠黥謦苘磬罄箐綮亲跫蛩銎邛茕筇穹龟仇楸蚯鳅湫裘逑蝤虬赇俅鼽犰遒巯糗匚麴蕖觑蛐黢岖祛诎璩蘧磲瞿氍蠼衢朐鸲劬癯苣阒戌悛鬈荃辁蜷铨筌诠畎绻阙悫阕逡麇髯蚺苒穰禳荛桡娆若喏荏稔葚轫仞饪衽榕蝾嵘肜狨鞣蹂糅薷颥嚅铷濡襦蓐溽洳缛朊蕤芮枘睿蚋箬偌仨挲卅脎飒思噻彡毵霰馓糁氵磉搡颡瘙臊鳋缲缫埽梢塞啬铯穑食厕厮蛳咝锶澌厶缌鸶耜兕笥俟泗汜祀驷姒灬菘崧嵩忪凇淞竦悚螋嗖锼馊飕溲薮瞍嗾叟缩稣蔌嗉簌觫夙愫涑谡狻尿荽眭睢濉燧邃谇荪狲飧榫隼莎桫睃嗦嗍羧挲娑唢杉厦铩痧挲鲨裟霎嗄唼歃色酾栅掸掺单髟埏芟跚钐舢膻潸姗蟮鳝疝鄯剡禅讪骟嬗凵殇觞熵汤垧绱鞘召蛸筲艄苕杓潲劭折畲猞佘厍歙麝滠参什莘糁诜哂矧渖谂葚椹蜃胂乘笙渑眚晟嵊嘘峙似匙蓍酾鲺埘莳鲥炻豕螫贳轼铈舐筮弑谥殖饣礻熟艏狩绶俞菽摅倏毹殳姝纾疋秫塾丨腧澍沭忄唰率蟀闩涮泷孀说数蒴搠铄槊妁拓遢趿铊溻鳎榻嗒闼漯沓薹跆鲐骀炱邰呔钛肽弹覃昙镡锬郯澹忐钽耥镗铴羰瑭樘醣螳螗饧溏傥帑焘韬饕叨啕鼗洮慝忑忒铽滕荑醍鹈缇绨倜逖悌裼扌佃畋钿阗忝殄掭佻调祧髫苕龆蜩笤鲦窕粜萜餮莛葶霆蜓婷梃町铤侗恫嗵垌茼砼峒佟仝潼恸冂骰钭荼菟酴钍堍抟疃彖忒煺囤褪暾豚饨氽舵魄乇坨柁橐酡砣跎鼍铊佗沱庹柝箨凹娲佤腽崴娩蔓蜿剜芄纨琬莞菀畹脘绾芒尢辋罔魍惘遗葳薇崴逶偎煨隈圩囗帏帷嵬闱涠沩玮隗韪艉鲔猥痿炜洧诿娓軎猬雯璺阌刎汶亠蓊蕹莴喔倭硪龌幄肟渥恶亡圬兀邬於唔蜈鼯浯鹉迕牾仵庑怃忤妩芴杌痦焐鋈寤阢鹜骛婺腊栖熹菥茜皙樨醯曦蹊蜥螅蟋唏僖鼷舾翕歙欷郗兮奚羲粞淅浠穸裼嬉觋隰葸蓰徙玺禧屣舄饩阋禊唬呷瑕柙硖黠狎瘕遐罅铣洗见莶酰暹跹氙籼祆痫鹇娴藓燹跣蚬筅猃冼苋霰岘降葙芗骧缃庠饷鲞飨蟓枵逍哓蛸箫魈枭潇骁绡崤筱血叶契解颉撷偕勰缬薤榭榍躞獬邂亵廨燮渫瀣绁寻馨昕鑫歆镡囟省荥硎饧陉擤荇悻芎臭宿髹咻鸺貅馐庥岫溴吁砉顼圩盱胥栩醑糈浒诩勖煦洫溆蓿券萱揎暄儇煊谖璇痃漩楦碹镟铉炫泫渲削踅噱泶鳕谑荤浚埙薰醺曛獯窨荀峋郇鲟恂洵浔徇巽彐匹轧垭桠琊睚岈伢痖疋砑揠迓氩娅铅鄢菸崦殷腌胭恹阏湮嫣芫檐筵闫阽妍琰郾厣魇罨俨偃鼹兖剡酽餍赝晏焱滟谳讠鞅泱蛘徉烊陶约侥钥疟吆夭幺珧轺铫徭肴爻繇鳐杳崾窈曜鹞邪拽咽哗揶铘邺晔烨谒靥蛇蛾尾艾欹咿噫黟猗漪圯荑眙咦贻嶷迤饴痍怡诒苡酏钇舣旖埸懿薏翳殪挹轶弋呓蜴嗌峄镱镒佚仡佾劓刈瘗癔弈奕翊悒怿熠羿驿缢衤烟堙喑铟氤湮洇圻垠鄞霪龈狺夤蚓吲瘾茚胤窨瑛璎莺撄嘤罂鹦膺茔蓥荥萦楹嬴滢潆瀛郢颍瘿媵育唷墉镛鳙壅饔慵邕喁俑甬呦攸莜莸柚尢蚰蝣蝤繇鱿疣猷莠卣黝铕牖蚴囿侑鼬宥尉蔚谷粥瘀於纡瑜萸雩揄欤禺蝓嵛竽舁臾觎腴狳馀窬谀妤龉圉圄伛俣庾瘐窳菀蓣昱蜮钰毓鹆饫阈煜燠谕聿熨鬻鹬妪肀鸢鸢箢眢鼋塬芫橼螈圜爰沅媛瑗垸掾乐说樾栎钺龠刖瀹均氲芸员昀筠纭殒狁韫愠恽郓熨咋扎咱拶咂甾崽仔簪糌趱拶昝甾崽仔簪糌趱拶昝瓒錾藏臧驵奘缲唣侧赜啧咋帻迮箦笮舴仄昃谮罾缯综锃甑吱髭趑辎龇赀觜訾呲嵫锱鲻孳粢谘缁耔茈梓秭笫姊眦恣枞腙偬粽鄹鲰诹陬驺辶菹镞俎躜缵攥赚堆咀觜蕞樽鳟撙琢凿撮嘬笮酢唑胙怍祚阼阝查蜡楂揸哳吒齄喋砟柞蚱咤痄侧择翟祭砦瘵旃谵搌颤长璋蟑长璋蟑獐鄣嫜仉幛嶂朝着嘲爪啁钊棹笊诏着蜇磔摺辄谪赭褶柘鹧这蓁榛椹桢箴胗溱浈祯轸畛稹缜圳赈朕鸩丁峥钲铮筝徵鲭诤氏识栀卮胝祗埴絷摭跖踯芷枳酯轵黹徵祉咫栉桎贽鸷轾郅踬蛭帙雉豸膣觯痣忮陟骘彘舯锺螽忪踵冢啁碡妯荮酎胄籀繇纣绉术茱槠铢邾侏橥洙潴躅竺舳瘃麈渚褚属翥苎杼箸伫疰炷挝转曳嘬传颛啭馔沌幢奘僮戆丬隹隹骓惴缒屯肫窀缴焯涿著斫擢镯浞濯禚诼倬"
					.getBytes(s1);
			_HZ_ABC_Tab = HZ_ABC_Tab.getBytes(s1);
			abyte0 = s.getBytes(s1);
		} catch (Exception exception) {
			throw new Exception((new StringBuilder()).append("使用了系统不支持的字符集！").append(exception.toString()).toString());
		}
		int k = 0;
		int i1 = 0;
		int j1 = 0;
		byte abyte1[] = new byte[512];
		byte abyte2[] = new byte[512];
		int i = 0;
		int j = 0;
		for (; i < abyte0.length; i++) {
			if (abyte0[i] >= 97 && abyte0[i] <= 122) {
				abyte2[j++] = (byte) ((abyte0[i] - 97) + 65);
				continue;
			}
			if (abyte0[i] >= 65 && abyte0[i] <= 90) {
				abyte2[j++] = abyte0[i];
				continue;
			}
			if ((abyte0[i] & 0xff) < 161)
				continue;
			if ((abyte0[i] & 0xff) < 176) {
				if ((abyte0[i + 1] & 0xff) < 161 || (abyte0[i + 1] & 0xff) > 254)
					continue;
				k = 0;
				do {
					if (k >= _HZ_ABC_Tab.length)
						break;
					if ((abyte0[i] & 0xff) == (_HZ_ABC_Tab[k] & 0xff) && (abyte0[i + 1] & 0xff) == (_HZ_ABC_Tab[k + 1] & 0xff)) {
						k = (k / 2) % 26;
						abyte2[j++] = (byte) (65 + k);
						break;
					}
					k += 2;
				} while (true);
				i++;
				continue;
			}
			if ((abyte0[i] & 0xff) > 247 || (abyte0[i + 1] & 0xff) < 161 || (abyte0[i + 1] & 0xff) > 254)
				continue;
			int i2 = (abyte0[i] & 0xff) << 8 | abyte0[i + 1] & 0xff;
			int j2 = -1;
			int l2 = 0;
			for (k = 0; k < 26 && i2 >= ai[k]; k++)
				;
			if (k < 26) {
				j2 = j;
				abyte1[i1] = (byte) j2;
				abyte2[j++] = (byte) (65 + k);
			}
			for (k = 0; k < _HZ_Ext_Tab.length; k += 2) {
				if (abyte0[i] != _HZ_Ext_Tab[k] || abyte0[i + 1] != _HZ_Ext_Tab[k + 1])
					continue;
				int k1;
				for (k1 = 0; k1 < 26 && k / 2 >= _HZ_Ext_Num[k1]; k1++)
					;
				if (k1 >= 26)
					continue;
				if (j2 < 0) {
					j2 = j;
					abyte1[i1] = (byte) j2;
					abyte2[j++] = (byte) (65 + k1);
				} else {
					l2 = 1;
					abyte1[++i1] = (byte) (65 + k1);
				}
			}

			if (l2 > 0) {
				abyte1[++i1] = 0;
				i1++;
				j1++;
			}
			i++;
		}

		if (j == 0)
			return new String[0];
		abyte2[j++] = 0;
		i = j;
		int k2 = 1;
		k = 0;
		i1 = 0;
		for (; k < j1; k++) {
			byte byte0 = abyte1[i1++];
			for (; abyte1[i1] > 0; i1++) {
				if (abyte1[i1] == abyte2[byte0])
					continue;
				int l1;
				for (l1 = i1 + 1; abyte1[l1] > 0 && abyte1[i1] != abyte1[l1]; l1++)
					;
				if (abyte1[l1] > 0)
					continue;
				if (j + i > 512)
					break;
				int i3 = j;
				for (int j3 = 0; j3 < i - 1; j3++) {
					abyte2[i3] = abyte2[j3];
					i3++;
				}

				abyte2[j + byte0] = abyte1[i1];
				j += i;
				k2++;
			}

			i1++;
		}

		String as[] = new String[k2];
		for (int l = 0; l < as.length; l++)
			as[l] = new String(abyte2, l * i, i - 1);

		return as;
	}

}
